In [2]:
import numpy as np
import pandas as pd
import statistics as st
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
data=pd.read_csv('StudentsPerformance.csv')

In [3]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [30]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [4]:
data.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [11]:
data.shape

(1000, 8)

### 1.Number of male and female in the test

In [13]:
data["gender"].value_counts()

female    518
male      482
Name: gender, dtype: int64

### 2.student's parental level of education is more in some college

In [15]:
data["parental level of education"].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

### 3.Average for math score,reading score,writing score

In [22]:
st.mean(data["math score"])

66.001

In [16]:
st.mean(data["reading score"])

69.195

In [17]:
st.mean(data["writing score"])

68.119

In [41]:
data.groupby(by='gender').mean()

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [18]:
data.groupby(by='parental level of education').mean()

                             math score  reading score  writing score
parental level of education
associate's degree            67.977477      71.018018      70.031532
bachelor's degree             69.288136      73.000000      73.381356
high school                   61.821429      64.602041      62.403061
master's degree               70.254237      75.949153      75.677966
some college                  67.128319      69.566372      69.035398
some high school              63.134078      66.759777      64.888268

### 4. Scoring variation for math score,reading score,writing score

In [4]:
data.groupby(by="gender").std()

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

In [5]:
data.groupby(by="parental level of education").std()

                             math score  reading score  writing score
parental level of education
associate's degree            15.108190      13.842999      14.260787
bachelor's degree             15.164117      14.285250      14.728262
high school                   15.160466      14.245280      14.165172
master's degree               14.843544      13.046896      13.730711
some college                  14.871790      14.312932      15.089911
some high school              16.602894      15.710633      15.736197

### 5. Top 25percent of students based on math score

In [9]:
data["math score"].quantile(.25)

57.0